Repository: cevi/nextcloud-hitobito-login
Catalog: translationfiles/*/hitobitologin.po
Languages: de

source: You must access Nextcloud with HTTPS to use Hitobito login.
de: Du musst mit HTTPS auf Nextcloud zugreifen, um Hitobito Login zu verwenden.

source: Missing configuration for Hitobito login
de: Fehlende Konfiguration für Hitobito Login

source: Missing code parameter
de: Code Parameter fehlt

source: Access denied: You have no groups
de: Zugriff verweigert: Du hast keine Gruppen

source: Multiple users found for Hitobito ID %1$s
de: Mehrere Benutzer mit Hitobito ID %1$s gefunden

source: Multiple users found for email %1$s
de: Mehrere Benutzer mit E-Mail %1$s gefunden

source: Failed to authenticate user
de: Benutzer konnte nicht authentifiziert werden

source: Base-URL is required
de: Basis-URL wird benötigt

source: Base-URL is not a valid URL
de: Basis-URL ist keine gültige URL

source: Client-ID is required
de: Client-ID wird benötigt

source: Client-Secret is required
de: Client-Secret wird benötigt

source: Login-Button text is required
de: Login-Button Text wird benötigt

source: Group is required
de: Gruppe wird benötigt

source: Role is required
de: Rolle wird benötigt

source: Settings saved successfully
de: Einstellungen erfolgreich gespeichert

source: Failed to save settings
de: Einstellungen konnten nicht gespeichert werden

source: General
de: Allgemein

source: General options regarding the login with Hitobito
de: Allgemeine Optionen für die Anmeldung bei Hitobito

source: Automatically remove groups from user
de: Automatisch Gruppen von Benutzern entfernen

source: Block users without a mapped group/role match
de: Sperren von Benutzern ohne zugeordnete Gruppen/Rollenübereinstimmung

source: Search for existing users by email
de: Suche nach bestehenden Benutzern per E-Mail

source: Use Hitobito as default login
de: Hitobito als Standard Login-Methode benutzen

source: Base-URL
de: Basis-URL

source: Group mapping
de: Gruppenzuordnung

source: In this section the mapping between group/role combination with an existing Nextcloud group can be done
de: In diesem Abschnitt kann die Zuordnung zwischen einer Gruppe/Rollenkombination und einer bestehenden Nextcloud-Gruppe vorgenommen werden

source: Hitobito-Group
de: Hitobito-Gruppe

source: Hitobito-Role
de: Hitobito-Rolle

source: Groups to map to
de: Zuzuordnende Gruppen

source: Remove mapping
de: Zuordnung entfernen

source: Add new mapping
de: Neue Zuordnung hinzufügen
